const Map<String, String> holiday = {
  //2022年休業日
  '2022-01-01': '元日',
  '2022-01-02': '休業日',
  '2022-01-03': '休業日',
  '2022-01-10': '成人の日',
  '2022-02-11': '建国記念の日',
  '2022-02-23': '天皇誕生日',
  '2022-03-21': '春分の日',
  '2022-04-29': '昭和の日',
  '2022-05-03': '憲法記念日',
  '2022-05-04': 'みどりの日',
  '2022-05-05': 'こどもの日',
  '2022-07-18': '海の日',
  '2022-08-11': '山の日',
  '2022-09-19': '敬老の日',
  '2022-09-23': '秋分の日',
  '2022-10-10': 'スポーツの日',
  '2022-11-03': '文化の日',
  '2022-11-23': '勤労感謝の日',
  '2022-12-31': '休業日',
  //2023年休業日
  '2023-01-01': '元日',
  '2023-01-02': '振替休日',
  '2023-01-03': '休業日',
  '2023-01-09': '成人の日',
  '2023-02-11': '建国記念の日',
  '2023-02-23': '天皇誕生日',
  '2023-03-21': '春分の日',
  '2023-04-29': '昭和の日',
  '2023-05-03': '憲法記念日',
  '2023-05-04': 'みどりの日',
  '2023-05-05': 'こどもの日',
  '2023-07-17': '海の日',
  '2023-08-11': '山の日',
  '2023-09-18': '敬老の日',
  '2023-09-23': '秋分の日',
  '2023-10-09': 'スポーツの日',
  '2023-11-03': '文化の日',
  '2023-11-23': '勤労感謝の日',
  '2023-12-31': '休業日',
};

double getTickRange(double value) {
  if (value <= 3000) {
    return 1.0;
  } else if (5000 >= value && value >= 3000) {
    return 5.0;
  } else if (10000 >= value && value >= 5000) {
    return 10.0;
  } else if (30000 >= value && value >= 10000) {
    return 10.0;
  } else if (50000 >= value && value >= 30000) {
    return 50.0;
  } else if (100000 >= value && value >= 50000) {
    return 100.0;
  } else if (300000 >= value && value >= 100000) {
    return 100.0;
  } else if (500000 >= value && value >= 300000) {
    return 500.0;
  } else if (1000000 >= value && value >= 500000) {
    return 1000.0;
  } else if (3000000 >= value && value >= 1000000) {
    return 1000.0;
  } else if (5000000 >= value && value >= 3000000) {
    return 5000.0;
  } else if (10000000 >= value && value >= 5000000) {
    return 10000.0;
  } else if (30000000 >= value && value >= 10000000) {
    return 10000.0;
  } else if (50000000 >= value && value >= 30000000) {
    return 50000.0;
  } else {
    return 100000.0;
  }
}
